### Bibliotecas

In [5]:
import pandas as pd

### Carregamento de dados

In [7]:
acessos = pd.read_excel('compras_e_acessos.xlsx', sheet_name='acessos')

In [8]:
acessos

   user_id user_name  total
0        8     RENAN     10
1        3  GABRIELA      2
2        5    REBECA    399
3        6     PEDRO     21
4        7     JAMES      1

In [9]:
compras = pd.read_excel('compras_e_acessos.xlsx', sheet_name='compras')

In [10]:
compras

   user_id user_name  total
0        2      JOÃO     78
1        3  GABRIELA    100
2        5    REBECA     22
3        6     PEDRO    332
4        1   MARIANA     13

### Merge

#### SQL JOIN: Usuários que tem acessos E comrpas, trazendo também as informações de ambas as tabelas

In [11]:
inner_join = acessos.merge(compras, how='inner', on='user_id')

In [12]:
inner_join

   user_id user_name_x  total_x user_name_y  total_y
0        3    GABRIELA        2    GABRIELA      100
1        5      REBECA      399      REBECA       22
2        6       PEDRO       21       PEDRO      332

#### SQL LEFT JOIN: Usuários que têm acessos, mas também queremos trazer o total de compras, caso tenham feito

In [16]:
left_join = acessos.merge(compras, how='left', on='user_id')

In [17]:
left_join

   user_id user_name_x  total_x user_name_y  total_y
0        8       RENAN       10         NaN      NaN
1        3    GABRIELA        2    GABRIELA    100.0
2        5      REBECA      399      REBECA     22.0
3        6       PEDRO       21       PEDRO    332.0
4        7       JAMES        1         NaN      NaN

#### SQL RIGHT JOIN: Usuários que tem compras, mas também trazer o total de acessos, caso tenham feito

In [18]:
right_join = acessos.merge(compras, how='right', on='user_id')

In [19]:
right_join

   user_id user_name_x  total_x user_name_y  total_y
0        2         NaN      NaN        JOÃO       78
1        3    GABRIELA      2.0    GABRIELA      100
2        5      REBECA    399.0      REBECA       22
3        6       PEDRO     21.0       PEDRO      332
4        1         NaN      NaN     MARIANA       13

#### SQL FULL JOIN: Usuários que tem acessos OU compras, trazendo as informações de âmbos, caso existam

In [23]:
full_join = acessos.merge(compras, how='outer', on='user_id')

In [24]:
full_join

   user_id user_name_x  total_x user_name_y  total_y
0        8       RENAN     10.0         NaN      NaN
1        3    GABRIELA      2.0    GABRIELA    100.0
2        5      REBECA    399.0      REBECA     22.0
3        6       PEDRO     21.0       PEDRO    332.0
4        7       JAMES      1.0         NaN      NaN
5        2         NaN      NaN        JOÃO     78.0
6        1         NaN      NaN     MARIANA     13.0